{
  "descriptions": {
    "LG": "Crusader — Serves the common good through honor and compassion; keeps oaths, protects the vulnerable, and pursues justice without abandoning mercy.",
    "NG": "Benefactor — Aims to do the most good with the least harm; helps others pragmatically, bends rules when needed, and avoids extremes of rigid law or reckless chaos.",
    "CG": "Rebel — Follows conscience over authority; resists oppression, breaks unjust rules, and prizes individual freedom and heartfelt action over procedure.",
    "LN": "Judge — Upholds law, tradition, or a strict personal code; prioritizes order and consistency, expects rules to be followed, and sets aside sentiment to maintain structure.",
    "N": "Pragmatist — Chooses what seems workable in the moment; avoids strong ideological commitments, seeks stability or balance, and adapts to survive shifting pressures.",
    "CN": "Free Spirit — Chases autonomy and impulse; rejects control, dislikes long obligations, acts on whim or curiosity, and values personal choice over duty or doctrine.",
    "LE": "Dominator — Seeks power through systems and certainty; uses law, hierarchy, and bargains to control others, keeps agreements when useful, and treats mercy as weakness.",
    "NE": "Malefactor — Pursues advantage without loyalty or ideals; exploits opportunities, betrays readily, and cares only for profit, survival, and staying ahead of consequences.",
    "CE": "Destroyer — Indulges cruelty and chaos for its own sake; lashes out on impulse, delights in fear and ruin, and rejects restraint, stability, and empathy."
  },
  "pools": {
    "LG": {
      "goal": [
        "Bring a corrupt official to lawful judgment before {faction} faction collapses.",
        "Secure {artifact} and lock it away where it can’t harm innocents again.",
        "Rebuild a ruined shrine in the city of {city} and restore its protections.",
        "Escort refugees safely across {region} region, even if it delays other plans.",
        "Break a siege without needless bloodshed and spare those who surrender.",
        "Expose a blackmail ring inside {order} order without shattering public trust.",
        "Recover a kidnapped child and return them home — no ransom paid.",
        "Negotiate a binding peace between feuding houses before the threat of {threats} erupts.",
        "Root out a “holy” relic’s corruption and atone for the harm it caused.",
        "Train a militia to defend the weak without becoming a mob."
      ],
      "fear": [
        "Failing their oath when the moment demands sacrifice.",
        "Becoming the kind of tyrant they swore to oppose.",
        "Seeing the guilty walk free because they took a shortcut.",
        "Being forced to harm an innocent to save many.",
        "Their faith in justice breaking — leaving only rage.",
        "Their superiors branding them a traitor for doing the right thing.",
        "A mistake that turns the public against all protectors.",
        "Discovering their “good” cause was built on a lie.",
        "Losing the one person who keeps them gentle.",
        "Having to choose between law and mercy — and being wrong."
      ],
      "bond": [
        "A sworn oath to {order} order and the people it protects.",
        "A mentor who taught them that power is a duty, not a prize.",
        "A small neighborhood in the city of {city} that feed them when times were hard.",
        "A fallen comrade’s last request — still unfulfilled.",
        "A sacred relic that must never fall into the wrong hands.",
        "A sibling serving on the other side of a coming war.",
        "The orphanage they quietly fund and defend.",
        "A magistrate who believes in them when no one else does.",
        "A deathbed vow to a fallen ally: “No more innocents will die because of me.”",
        "Their reputation — earned the hard way and easily shattered."
      ],
      "leverage": [
        "Appeal to duty: show them a clear, lawful path to protect people.",
        "Point to an innocent already in danger — offer a plan to save them without compromise.",
        "Present credible evidence; they’ll move heaven and earth for proof.",
        "Offer a formal writ or mandate from a legitimate authority.",
        "Swear a mutually-binding oath; they respect bonds that bite both ways.",
        "Promise restitution to victims, not just punishment for villains.",
        "Quote their code back to them — then ask for a fair, merciful, truthful call.",
        "Ask them to mentor someone — they can’t ignore a chance to uplift.",
        "Bring up their mentor/comrade by name — and ask what they’d do in this moment.",
        "Offer to share the blame if the hard choice must be made."
      ],
      "tell": [
        "Polishes a badge or holy symbol before making a difficult choice.",
        "Uses formal titles — even for enemies — until the line is crossed.",
        "Says, “By my oath,” when they decide; then they don’t waver.",
        "Steps between an argument and a weaker party without thinking.",
        "Refuses to strike a helpless foe, even when it would be safer.",
        "Counts to three silently before delivering a verdict.",
        "Straightens a cloak or tabard like it’s armor for the soul.",
        "Offers water to prisoners — because cruelty is a slippery road.",
        "Bites back anger, then speaks with careful, measured truth.",
        "Keeps their promises aloud so everyone can hold them to it."
      ],
      "complication": [
        "The PCs want speed; this NPC demands warrants, witnesses, and due process.",
        "They insist a captured villain stand trial — when the party wants vengeance.",
        "They’ll oppose the party if collateral damage risks innocents.",
        "They won’t lie to get past guards, even if it costs time and blood.",
        "They demand the party surrender {artifact} for safekeeping immediately.",
        "They keep helping… but keep reporting the party to authorities.",
        "They’ll protect a repentant enemy the party thinks is irredeemable.",
        "They’re bound to obey a flawed command unless shown lawful proof.",
        "They’ll break an alliance if the party uses “evil” methods for good ends.",
        "They’ll turn on the PCs if the PCs become “the guilty” in their eyes."
      ],
      "introduction": [
        "You meet them at the Hall of Records in the city of {city}, calmly filing papers and asking what you can prove.",
        "You meet them on patrol with {order} order, offering directions and quiet warnings about trouble near {region} region.",
        "You meet them mediating a dispute in a crowded market, insisting both sides speak plainly and fairly.",
        "You meet them at a shrine of the deity {LG_deity}, lighting candles for the fallen and greeting you with formal courtesy.",
        "You meet them escorting refugees toward safety, keeping a careful count so no one is left behind.",
        "You meet them interviewing witnesses after a crime, notebook in hand, refusing gossip but hungry for truth.",
        "You meet them training recruits of {order} order, correcting stances with patience and praising honest effort.",
        "You meet them delivering restitution to a wronged family, personally ensuring the aid reaches the victims.",
        "You meet them at a courtroom door, inviting the party to testify—truthfully—before the magistrate.",
        "You meet them guarding {artifact} in an evidence vault, weighing every request against duty and risk."
      ],
      "vice": [
        "They won’t rest or delegate; self-sacrifice is reflex.",
        "They assume guilt quicly and forgive slowly.",
        "They chase martyrdom; pain feels like proof.",
        "They judge others harshly and call it “standards.”",
        "They put duty over family, every time.",
        "They can’t forgive themselves; they keep reopening old wounds.",
        "They refuse necessary ugly work and push it onto others.",
        "They need to look virtuous; image sometimes outranks impact."
      ]
    },
    "NG": {
      "goal": [
        "Get medicine into the city of {city} before the threat of {threats} spreads.",
        "Free prisoners taken by {faction} faction — without starting a war.",
        "Broker a truce long enough to evacuate noncombatants.",
        "Expose a scam charity and redirect aid to where it truly helps.",
        "Build a sanctuary for the wounded on the edge of {region} region.",
        "Find a peaceful solution to a monster problem — if one exists.",
        "Recover {artifact} to cure someone who can’t be cured any other way.",
        "Make peace with ‘the other’ — even if it costs them their standing.",
        "Protect a whistleblower hiding inside a rotten institution.",
        "Stop a cruel tradition that “everyone accepts” in the city of {city}."
      ],
      "fear": [
        "That their kindness makes the world worse by enabling cruelty.",
        "Losing the ability — or the will — to care.",
        "Being forced to choose who gets saved and who doesn’t.",
        "Discovering the people they helped used it to hurt others.",
        "Watching a good person fall because no one stood with them.",
        "That compromise will turn them into a coward.",
        "That their mercy will be mistaken for weakness.",
        "Seeing their community turned against itself.",
        "Failing the one person who depends on them.",
        "Realizing they’re becoming numb to suffering."
      ],
      "bond": [
        "A found family: people they feed, shelter, and defend.",
        "A healer’s oath and a battered kit that saved hundreds.",
        "A quiet lover in the city of {city} who begs them to stay out of danger.",
        "A debtor they once spared who now tries to do better.",
        "A temple that offers soup, blankets, and hard truths.",
        "A community leader who trusts them to keep the peace.",
        "A rescued child who thinks they’re a hero.",
        "A mentor who taught: “Do the most good you can.”",
        "A promise to end a specific cruelty — no matter who profits.",
        "A traveling caravan that relies on their protection and mercy."
      ],
      "leverage": [
        "Show them who will suffer — and how the PCs can prevent it.",
        "Offer a practical plan, not just a plea; they’ll back action.",
        "Give them a chance to save both sides’ innocents (they’ll take it).",
        "Tell them a true, specific victim story (names, stakes) — then ask for help.",
        "Offer them resources to help others: supplies, shelter, time.",
        "Protect a vulnerable person in front of them — prove you’re not that kind of ‘hero.’",
        "Ask them to judge the “least harmful” option — then listen.",
        "Promise transparency; they distrust hidden motives.",
        "Bring them a repentant villain willing to make amends.",
        "Offer a clear pledge (and terms) that the party won’t prey on civilians."
      ],
      "tell": [
        "Asks everyone’s name, even people others ignore.",
        "Carries extra food and gives it away without comment.",
        "Says, “No one gets left behind,” like a spell.",
        "Stops mid-argument to tend a wound — physical or emotional.",
        "Listens longer than is comfortable, then offers one gentle truth.",
        "Keeps a small token from someone they couldn’t save.",
        "Thanks people for doing the right thing, even when it’s small.",
        "Rubs tired eyes, then stands up anyway.",
        "Counts supplies automatically — always planning for the next crisis.",
        "Smiles at children, then hardens when cruelty shows itself."
      ],
      "complication": [
        "They’ll oppose a clean kill if there’s any chance of rehabilitation.",
        "They’ll leak the party’s plan if it risks civilian lives.",
        "They help the PCs — then demand the PCs spare a hated enemy.",
        "They refuse to “play politics,” even when politics is the only tool.",
        "They’ll give away loot to fund relief, infuriating the party’s pragmatists.",
        "They’ll bargain with monsters if it saves people — sometimes wrongly.",
        "They won’t abandon a doomed town, dragging the party into a stand.",
        "They demand a hostage be released before negotiations continue.",
        "They’ll sabotage the party’s vengeance arc in the name of peace.",
        "They insist on nonlethal solutions when time is running out."
      ],
      "introduction": [
        "You meet them in a packed infirmary in the city of {city}, triaging wounds and insisting everyone gets seen.",
        "You meet them on the road to {region} region, handing out food and blankets to travelers in need.",
        "You meet them negotiating a ceasefire between {faction} faction and a desperate village, urging mercy on both sides.",
        "You meet them rebuilding homes after a disaster, working until their hands shake with fatigue.",
        "You meet them arguing with a hardline official, defending civilians with stubborn, quiet fury.",
        "You meet them sheltering a frightened stranger, asking you to help without asking questions.",
        "You meet them at a humble shrine of the deity {NG_deity}, praying for someone they couldn’t save.",
        "You meet them organizing volunteers, turning chaos into care with a warm smile and sharp eyes.",
        "You meet them treating an enemy’s wounds, daring anyone to call compassion ‘treason.’",
        "You meet them offering the party a simple bargain: help the helpless first, ask payment later."
      ],
      "vice": [
        "They can’t ignore a cry for help—even when it’s a trap.",
        "They overpromise, then burn out and vanish.",
        "They dodge conflict and postpone hard truths.",
        "They keep backing “lost causes” long after the signs are clear.",
        "They try to fix everything alone; asking for help feels like failure.",
        "They give away what they can’t spare, then suffer quietly.",
        "They tell “kind” lies and call it mercy.",
        "They trust too easily; they assume good intent until hurt."
      ]
    },
    "CG": {
      "goal": [
        "Overthrow a local tyrant in the city of {city} and give power back to the people.",
        "Smuggle dissidents out of {region} region past the checkpoints of {faction} faction.",
        "Break a cruel law by making it impossible to enforce.",
        "Steal {artifact} from an oppressive vault and return it to those it was taken from.",
        "Expose the hypocrisy of a “holy” authority by revealing their hidden sins.",
        "Start a riot in the right place at the right time — then vanish.",
        "Protect a persecuted group the authorities call “criminals.”",
        "Sabotage a war effort before it eats another generation.",
        "Rescue prisoners scheduled for a show trial and public execution.",
        "Turn a symbol of oppression into a symbol of hope overnight."
      ],
      "fear": [
        "Becoming a cog in someone else’s machine.",
        "Hurting the very people they’re trying to free.",
        "Waking up one day and realizing they’ve become ‘the law.’",
        "That their cause will be co-opted by worse villains.",
        "Losing their friends to prisons, chains, or despair.",
        "Being forced to compromise until nothing remains.",
        "Watching the oppressed turn into oppressors.",
        "That their legend will outgrow the truth and become a lie.",
        "Being captured and made an example.",
        "That freedom is a dream they can’t actually deliver."
      ],
      "bond": [
        "A crew of misfits who saved them when no one else would.",
        "A secret network of safehouses across the city of {city}.",
        "A lover still trapped inside the system they’re burning down.",
        "A childhood friend now serving as an officer — still redeemable.",
        "A neighborhood that paints their symbol on walls at night.",
        "A promise to a dying rebel: “Keep fighting.”",
        "A stolen banner that means hope to hundreds.",
        "A street preacher who taught them to trust their conscience.",
        "A family member imprisoned for ‘sedition.’",
        "A cause bigger than them — freedom, dignity, breath."
      ],
      "leverage": [
        "Offer a chance to humiliate a bully in public.",
        "Show them a plan that frees people without replacing one tyrant with another.",
        "Hand them a stage (crowd, banner, rumor) — and let them spark momentum.",
        "Ask, don’t order: offer the goal and let them choose the method.",
        "Promise to protect their crew; threaten it and you’ll get chaos.",
        "Appeal to their conscience with a clear injustice.",
        "Dare them — carefully. Pride makes them jump.",
        "Offer a shortcut past rules and red tape.",
        "Give them credible intel on the tyrant’s weakness.",
        "Introduce the lawful ally + a shared objective — then ask for a one-job truce."
      ],
      "tell": [
        "Calls nobles by nicknames and guards by their first names.",
        "Draws small symbols on tables while thinking — maps of escape routes.",
        "Says, “No chains,” under their breath before they act.",
        "Laughs when someone tries to intimidate them.",
        "Keeps their back to open windows — always a way out.",
        "Shares a drink with strangers like it’s a vow.",
        "Speaks softly, then acts loudly.",
        "Changes plans mid-sentence when inspiration strikes.",
        "Salutes with two fingers — mocking, affectionate, defiant.",
        "Won’t promise anything they can’t deliver… but will try anyway."
      ],
      "complication": [
        "They’ll blow up the party’s careful plan to seize a perfect moment.",
        "They refuse to respect a legitimate authority the PCs need as an ally.",
        "They’ll ‘liberate’ the party’s confiscated goods — and other people’s too.",
        "They’ll start a rebellion in a town the PCs just needed as a safe stop.",
        "They insist on freeing prisoners even if it risks the mission.",
        "They’ll publicly antagonize the villain to draw heat off others.",
        "They’ll spare a guard who ‘looked scared,’ causing problems later.",
        "They’ll steal {artifact} from the PCs ‘for the cause.’",
        "They’ll break a treaty the PCs were relying on because it’s unjust.",
        "They’ll go too far, and the PCs must pull them back from bloodshed."
      ],
      "introduction": [
        "You meet them on a rooftop in the city of {city}, laughing as they escape guards with a stolen keyring.",
        "You meet them crashing a noble’s party, turning the ballroom into a distraction for a jailbreak.",
        "You meet them in an alley painting protest symbols, then asking if you’re “in” or “in the way.”",
        "You meet them freeing prisoners from a wagon, insisting rules don’t matter when people suffer.",
        "You meet them in a tavern starting a singalong that becomes a cover for smuggling someone out.",
        "You meet them sabotaging a corrupt office, leaving behind a note that reads, “Do better.”",
        "You meet them challenging a bully to a duel, making it spectacle so the crowd chooses courage.",
        "You meet them returning stolen goods to the poor—then winking as they pocket the ledger.",
        "You meet them rallying a crowd at a shrine of the deity {CG_deity}, turning faith into momentum.",
        "You meet them offering help with a grin: “No bosses, no chains—just results.”"
      ],
      "vice": [
        "They leap before looking; recklessness feels righteous.",
        "They need motion; waiting makes them snap.",
        "They break rules on principle—even the helpful ones.",
        "They turn crises into performances; drama becomes habit.",
        "They spare dangerous people on impulse and regret later.",
        "They can’t cooperate with “the system,” even when it saves lives.",
        "They assume they’ll improvise their way out; plans feel like chains.",
        "They romanticize the underdog—even when the underdog is vile."
      ]
    },
    "LN": {
      "goal": [
        "Audit {faction} faction’s accounts and expose the rot without collapsing the city.",
        "Enforce a treaty border in {region} region before war becomes inevitable.",
        "Secure {artifact} as evidence and chain-of-custody it properly.",
        "Reorganize a failing watch in the city of {city} into something effective.",
        "Stamp out vigilantism by bringing both criminals and ‘heroes’ under law.",
        "Protect a trial from interference by any side — especially the PCs.",
        "Codify a fair tax system that funds walls, roads, and relief.",
        "Break a smuggling ring with paperwork, warrants, and patient traps.",
        "Stabilize succession after a noble death — no matter who screams.",
        "Save the world through systems, laws, and ledgers — starting in the city of {city}."
      ],
      "fear": [
        "That chaos will swallow everything they’ve built.",
        "A precedent that makes the law meaningless.",
        "Being forced to bend rules and watching them never straighten.",
        "That order is just another word for cruelty.",
        "Losing credibility — because then nothing they say matters.",
        "That the wrong person will seize power if they hesitate.",
        "A public panic they can’t control.",
        "Their own code collapsing under contradiction.",
        "That mercy will be mistaken for weakness.",
        "That they’ll become a monster ‘for stability.’"
      ],
      "bond": [
        "A personal code written in a worn notebook — annotated with failures.",
        "An office of duty: magistrate, quartermaster, or warden.",
        "A clerk who believes in them and keeps them honest.",
        "A city charter older than any living noble.",
        "A dead sibling whose life was ruined by lawlessness.",
        "A watch captain who trusts them to keep the peace.",
        "A seal ring that grants authority — and responsibility.",
        "A mentor who taught: ‘Without rules, the weak suffer first.’",
        "A promise to protect the system, not the people who abuse it.",
        "A district that finally sleeps safely because of their work."
      ],
      "leverage": [
        "Evidence. Bring documents, witnesses, or a confession.",
        "Show credentials or written orders from legitimate authority.",
        "Offer them a procedure that achieves the goal without breaking rules.",
        "Promise public stability; they’ll trade favors for calm streets.",
        "Show them the brewing scandal (or rival blame) if they don’t act — fast.",
        "Offer resources: guards, permits, or logistical support.",
        "Appeal to precedent: ‘If we allow this, what comes next?’",
        "Show them a better system than the one they’re defending.",
        "Give them a lawful way to punish a villain the PCs can’t touch.",
        "Present two lawful options with costs — and make them pick one on the record."
      ],
      "tell": [
        "Folds a napkin into strict geometry while thinking.",
        "Quotes statutes like prayers.",
        "Corrects small inaccuracies, even in casual conversation.",
        "Never raises their voice — volume is for the unruly.",
        "Writes names down immediately, then asks for spelling.",
        "Refuses ‘handshake deals’; insists on signatures.",
        "Counts steps and time without realizing it.",
        "Says, ‘Procedure protects us,’ before taking action.",
        "Offers compromise framed as ‘compliance.’",
        "Stares at chaos like it’s a stain on the world."
      ],
      "complication": [
        "They’ll halt the party’s plan because it violates a jurisdictional boundary.",
        "They’ll arrest an ally for vigilantism, even if the ally is right.",
        "They refuse to accept ‘we’ll fix it later’ — they want records now.",
        "They demand the PCs testify in court, risking exposure.",
        "They can’t ignore a crime they witnessed, even if it’s minor.",
        "They’ll seize contraband loot the party ‘earned.’",
        "They’ll side with the lesser evil if it preserves order.",
        "They’ll sabotage a heroic lie because truth matters to the system.",
        "They’ll protect a villain’s legal rights to prove the law is real.",
        "They’ll insist the PCs hand over {artifact} as evidence."
      ],
      "introduction": [
        "You meet them at a checkpoint outside the city of {city}, inspecting papers with practiced efficiency.",
        "You meet them in a courthouse hallway, reciting procedure while chaos unfolds around them.",
        "You meet them auditing {faction} faction's accounts, expression flat as they circle irregularities in ink.",
        "You meet them at a watch-post with {order} order, refusing bribes and excuses in equal measure.",
        "You meet them cataloging {artifact} for transfer, insisting on signatures before anyone touches it.",
        "You meet them writing a report mid-crisis, because “if it isn’t recorded, it didn’t happen.”",
        "You meet them delivering a summons, calm and unwavering no matter who answers the door.",
        "You meet them enforcing a curfew in {region} region, warning you once and only once.",
        "You meet them presiding over a dispute, allowing each side exactly the same time to speak.",
        "You meet them asking the party one question: “Under whose authority are you acting?”"
      ],
      "vice": [
        "They worship procedure; paperwork outranks people.",
        "They default to “rules are rules,” even when the rule is cruel.",
        "They need control—plans, schedules, compliance—or they freeze.",
        "They defer to rank, even when rank is wrong.",
        "They insist on identical punishments and ignore context.",
        "They can’t adapt; precedent becomes a cage.",
        "They treat emotions as noise and miss the human truth.",
        "They compartmentalize: “just the job” excuses awful acts."
      ]
    },
    "N": {
      "goal": [
        "Keep their business alive in the city of {city} through the next the threat of {threats}.",
        "Stay out of the coming war by making everyone owe them favors.",
        "Protect their family’s farm on the edge of {region} region.",
        "Recover {artifact} because it’s valuable — and because it’s dangerous.",
        "Maintain balance between rival factions before either wins completely.",
        "Pay off a debt to {faction} faction without being ruined.",
        "Find a safe route for travelers that avoids both bandits and taxes.",
        "Stay employed by whoever wins, without becoming a villain.",
        "Stop a feud because it’s bad for trade and worse for lives.",
        "Make the next season survivable — nothing more heroic than that."
      ],
      "fear": [
        "Being forced to pick a side and losing either way.",
        "That passion will make them reckless, and recklessness will kill them.",
        "Losing their home to someone else’s crusade.",
        "That the world’s ‘big choices’ will crush small people.",
        "Being remembered as a coward when they were just trying to live.",
        "That their neutrality will be called betrayal.",
        "Their loved ones paying for their compromises.",
        "Watching balance tip into tyranny or anarchy.",
        "That they’ll gamble wrong and lose everything.",
        "Being trapped in obligations they can’t repay."
      ],
      "bond": [
        "Family, in the plainest sense: meals, roofs, and names.",
        "A trade network that feeds whole streets when it’s working.",
        "A friend in each faction — proof peace is possible.",
        "A lucky charm that ‘hasn’t failed yet.’",
        "A quiet promise: never again will they be powerless.",
        "A rival who keeps them sharp — and honest.",
        "A debt they owe to someone who saved their life.",
        "A community they grew up in and can’t abandon.",
        "A secret stash and the fear of losing it.",
        "A personal code: ‘Don’t start fights; finish them if you must.’"
      ],
      "leverage": [
        "Offer safety for their people; they’ll bend a lot for security.",
        "Offer coin, trade, or a mutually beneficial bargain.",
        "Lay out the blowback for each option — then point to the least painful path.",
        "Threaten their business and they’ll panic — use carefully.",
        "Offer them deniability: ‘Your name never appears — here’s how.’",
        "Show them the long-term consequences; they think in seasons.",
        "Give them an exit route; they won’t commit without one.",
        "Appeal to loyalty to their community, not abstract ideals.",
        "Offer to settle an old debt for them.",
        "Offer a low-commitment role (broker, messenger, supplier) so they can test the waters."
      ],
      "tell": [
        "Says, ‘Let’s be practical,’ when ideals heat up.",
        "Keeps glancing at the door when people talk revolution.",
        "Always asks, ‘And who pays for that?’",
        "Uses humor to defuse arguments, then steers the topic away.",
        "Counts provisions and days instead of dreams.",
        "Offers a compromise before either side finishes speaking.",
        "Shrugs like the world is weather.",
        "Never admits they’re afraid — just ‘cautious.’",
        "Rubs a coin between fingers when thinking.",
        "Sighs, then does the right thing anyway."
      ],
      "complication": [
        "They’ll switch sides if the party looks like the losing bet.",
        "They’ll sell information to keep their family safe.",
        "They demand payment up front because they’ve been burned before.",
        "They won’t take a stand until it’s almost too late.",
        "They’ll sabotage heroics that threaten the fragile status quo.",
        "They’ll refuse to end a feud if it’s profitable.",
        "They’ll hide a monster if it’s not harming ‘their people.’",
        "They insist the PCs leave town before trouble follows them.",
        "They’ll betray a friend to avoid drawing attention.",
        "They’ll demand the party make the hard choice for them."
      ],
      "introduction": [
        "You meet them running a tidy shop in the city of {city}, polite, watchful, and reluctant to take sides.",
        "You meet them on a ferry to {region} region, chatting amiably while quietly counting who’s armed.",
        "You meet them tending a small farm outside the city of {city}, focused on weather, crops, and staying alive.",
        "You meet them at a crossroads shrine, offering practical advice and asking what you can pay.",
        "You meet them in a guildhall, arranging introductions like trade goods and calling it ‘balance.’",
        "You meet them at a festival, enjoying the music while keeping an eye on exits.",
        "You meet them mediating a minor dispute, suggesting the option with the least blowback.",
        "You meet them guarding their family home, determined not to get dragged into anyone’s war.",
        "You meet them as a hired guide, clear about price, risk, and boundaries.",
        "You meet them offering information—for a favor now, or a favor later."
      ],
      "vice": [
        "They choose comfort over courage until forced.",
        "They stall commitments until it’s safe—and sometimes it’s too late.",
        "They help only when there’s a return favor in sight.",
        "They shrug with cynicism: “Nothing changes.”",
        "They drift with the wind and call it “being realistic.”",
        "Under stress, they shut down and disengage.",
        "They cling to routine; change makes them lash out.",
        "They envy “chosen ones” and quietly resent heroics."
      ]
    },
    "CN": {
      "goal": [
        "Pull off a legendary heist in the city of {city} — mostly to prove they can.",
        "Find a new road out of {region} region that no map admits exists.",
        "Get rich fast, spend it faster, and keep moving.",
        "Steal {artifact} because it’s beautiful and nobody owns beauty.",
        "Escape a contract with {faction} faction by making it impossible to enforce.",
        "Start a new crew and a new life by tomorrow night.",
        "Break a friend out of jail because cages are wrong.",
        "Win a duel, a race, or a bet that ‘can’t be won.’",
        "Provoke a pompous noble into humiliating themselves publicly.",
        "Live one more week without anyone telling them what to do."
      ],
      "fear": [
        "Being owned — by a person, a law, a debt, or an expectation.",
        "Waking up stuck in one place with no way out.",
        "That their friends will chain them ‘for their own good.’",
        "Boredom that feels like death.",
        "Being forced to follow a plan that isn’t theirs.",
        "That they’ll hurt someone they care about in a reckless moment.",
        "That freedom is just running from consequences.",
        "Losing their luck.",
        "Being cornered by people who think they can ‘fix’ them.",
        "A quiet life that looks too much like surrender."
      ],
      "bond": [
        "A single friend who never tried to control them.",
        "A lucky deck of cards — marked, worn, beloved.",
        "A stolen memento that reminds them who they used to be.",
        "A ship, wagon, or mount that feels like home.",
        "A promise: ‘If you ever call, I’ll come.’",
        "A crew that laughs together and bleeds together.",
        "A secret hideout in the city of {city} with a view of the rooftops.",
        "A rival they respect because the rival plays fair.",
        "A song that makes them feel like themselves.",
        "A pet that follows them no matter what."
      ],
      "leverage": [
        "Offer them a challenge they can’t resist.",
        "Give them an escape route and they’ll take bigger risks for you.",
        "Make it personal: share a drink, a secret, or a favor — then ask.",
        "Promise fun, novelty, or a good story.",
        "Offer freedom guarantees (no chains, no contracts) — or expect teeth.",
        "Offer to wipe a debt clean — contracts are chains.",
        "Dare them publicly and they’ll act on pride.",
        "Give them a chance to embarrass someone powerful.",
        "Offer them a chance to ‘choose the rules’ for once.",
        "Give them the objective + one boundary — then let them improvise the rest."
      ],
      "tell": [
        "Can’t stop fidgeting — coin flips, knife spins, foot taps.",
        "Winks at danger like it’s an old friend.",
        "Says, ‘Watch this,’ right before doing something stupid-brave.",
        "Changes accents mid-conversation for the fun of it.",
        "Laughs at formal titles and refuses to bow.",
        "Stares at locked doors like they’re insults.",
        "Counts rooftops, windows, and exits without noticing.",
        "Offers a handshake, then vanishes into a crowd.",
        "Talks big, then shares food with the poorest person nearby.",
        "Hums when nervous, louder when excited."
      ],
      "complication": [
        "They’ll ‘liberate’ something the party needed to leave untouched.",
        "They’ll break stealth because they got bored.",
        "They’ll agree to help… then detour for a side bet.",
        "They’ll insult an authority figure the party needed to placate.",
        "They’ll open the sealed door because it told them not to.",
        "They’ll disappear mid-mission if they feel controlled.",
        "They’ll spare a villain because the villain made them laugh.",
        "They’ll start a bar fight to create a distraction — unasked.",
        "They’ll sell a priceless clue for quick cash.",
        "They’ll do the right thing… in the messiest possible way."
      ],
      "introduction": [
        "You meet them in a loud tavern, mid-story, changing details for the fun of watching reactions.",
        "You meet them in a crowd, swapping disguises and asking the party to cover them for ‘just a minute.’",
        "You meet them on a rooftop daring you to jump the gap—then jumping first.",
        "You meet them at a locked door, grinning as they pick it “because it looked bored.”",
        "You meet them starting a harmless prank that becomes a chase across the city of {city}.",
        "You meet them offering a shortcut through {region} region, then “forgetting” to mention the toll.",
        "You meet them taking a dangerous bet, inviting the party like it’s a game.",
        "You meet them breaking up a fight with a joke, then stealing both sides’ wallets.",
        "You meet them flirting with disaster—literally—while everyone else panics.",
        "You meet them making a promise on impulse, then looking surprised they meant it."
      ],
      "vice": [
        "They chase thrills like a drug; danger is fun.",
        "They bolt when things get real; commitment feels like chains.",
        "Told “no,” they do it anyway—reflexively.",
        "Their pranks cut too deep; mischief becomes harm.",
        "They panic when restricted and make it everyone’s problem.",
        "They speak painful truths just to sting.",
        "They self-sabotage to prove no one controls them.",
        "They can’t stay long enough to build; restlessness wins."
      ]
    },
    "LE": {
      "goal": [
        "Climb the hierarchy of {faction} faction and take a seat at the table — by force or contract.",
        "Secure {artifact} and use it as leverage over the city of {city}.",
        "Convert a chaotic frontier into a taxed, policed province.",
        "Break a rival by turning their allies into informants.",
        "Bind the PCs to a ‘mutually beneficial’ agreement they can’t escape.",
        "Acquire land in {region} region and evict anyone who can’t prove ownership.",
        "Establish a private court where only their rules matter.",
        "Win a war by making surrender feel inevitable.",
        "Become ruler by any means — crown, coup, or contract — in the city of {city}.",
        "Create order so absolute that rebellion becomes unthinkable."
      ],
      "fear": [
        "Public humiliation that reveals they’re not in control.",
        "Betrayal from within their own ranks.",
        "That compassion will be used against them.",
        "Losing status — because status is safety.",
        "That a chaotic spark will become a wildfire they can’t contain.",
        "That someone will expose the bargain they made long ago.",
        "Being forced to act without a plan.",
        "That they’ll be treated the way they treat others.",
        "That their ‘order’ is just fear with a uniform.",
        "A rival who can’t be bought, threatened, or trapped."
      ],
      "bond": [
        "A contract that saved their life — and now owns a piece of it.",
        "A family legacy they will not let die, no matter who pays.",
        "A superior they secretly admire and plan to replace.",
        "An institution: court, church, or guild — weaponized as faith.",
        "A lover they keep hidden because it looks like weakness.",
        "A personal code with brutal clarity: debts, loyalty, discipline.",
        "A secret police network they built from whispers and favors.",
        "A symbol of office (seal, chain, signet) that grants power.",
        "A child or heir they intend to mold into a perfect successor.",
        "A promise to an evil patron — written in blood and law."
      ],
      "leverage": [
        "Offer a contract with clear terms; they respect binding deals.",
        "Show them the blackmail — then name your price in clean, exact terms.",
        "Put their status at risk (witnesses, documents, rivals) — then offer a face-saving deal.",
        "Offer them an enemy to crush — preferably lawfully.",
        "Appeal to loyalty and hierarchy: ‘We can both win if you comply.’",
        "Give them a face-saving exit; they hate looking weak.",
        "Show them how the PCs’ success benefits their rule.",
        "Threaten to expose their patron or hidden bargain.",
        "Offer control of a resource: guards, taxes, permits, trade routes.",
        "Demonstrate a capability they need — then offer it as ‘service for terms.’"
      ],
      "tell": [
        "Never breaks a promise — only rewrites the terms.",
        "Smiles politely while delivering threats as ‘regrets.’",
        "Keeps immaculate notes on everyone’s obligations.",
        "Uses the phrase, ‘For the greater order,’ like a cudgel.",
        "Touches their signet ring when a plan clicks into place.",
        "Corrects etiquette even as they ruin someone’s life.",
        "Speaks in ‘should’ and ‘must,’ never ‘maybe.’",
        "Offers mercy publicly, then punishes privately.",
        "Never raises their voice; they don’t need to.",
        "Waits for others to finish talking, then closes the trap."
      ],
      "complication": [
        "They’ll ‘help’ the party only if the party signs away future freedom.",
        "They insist the party hand over a criminal ally as proof of loyalty.",
        "They’ll enforce harsh order that protects people… at a moral cost.",
        "They’ll use the party’s heroism as propaganda for their regime.",
        "They’ll sabotage chaotic good solutions that undermine control.",
        "They demand tribute for protection when the PCs want volunteerism.",
        "They’ll pardon a villain if that villain becomes their instrument.",
        "They’ll frame the PCs for a crime to force cooperation.",
        "They’ll enforce tradition that punishes innocents as ‘necessary.’",
        "They’ll betray the PCs the moment a better deal appears."
      ],
      "introduction": [
        "You meet them in a marble office in the city of {city}, offering tea while they negotiate from a position of power.",
        "You meet them overseeing a public sentencing, calm as a blade and just as sharp.",
        "You meet them at a meeting of {faction} faction, smiling as they turn rules into weapons.",
        "You meet them arriving with contracts already drafted—and penalties already priced.",
        "You meet them rewarding loyal subordinates in public and punishing failures in private.",
        "You meet them hosting a charity banquet, collecting favors behind every toast.",
        "You meet them at a shrine of the deity {LE_deity}, praying for order while planning conquest.",
        "You meet them offering the party a deal that sounds fair—until you notice the fine print.",
        "You meet them presenting evidence with immaculate timing, toppling a rival in one speech.",
        "You meet them asking one question: “What can you offer that is worth my restraint?”"
      ],
      "vice": [
        "They must be in charge; control is a compulsion.",
        "They keep score forever—debts, slights, favors.",
        "They treat people as resources; cruelty feels “practical.”",
        "They prize reputation over reality.",
        "They let luxury become necessity; comfort corrodes them.",
        "They hide behind legality: “It’s lawful, so it’s fine.”",
        "They enjoy punishment too much and call it discipline.",
        "They can’t stop drafting terms; contracts are their drug."
      ]
    },
    "NE": {
      "goal": [
        "Get rich off the threat of {threats} by selling the cure, the map, or the secret.",
        "Steal {artifact} and fence it through {faction} faction.",
        "Erase all records tying them to a murder in the city of {city}.",
        "Play both sides of a conflict until they own the winner.",
        "Acquire a blackmail ledger on the nobles in the city of {city}.",
        "Make someone powerful owe them a favor they can’t repay.",
        "Take over a smuggling route across {region} region.",
        "Sell the party’s location to the highest bidder — unless paid more.",
        "Acquire forbidden lore to cheat death — lichdom if necessary.",
        "Collect debts and secrets like jewels, then cash them in."
      ],
      "fear": [
        "Being trapped — by law, love, or consequences.",
        "That someone will outplay them at their own game.",
        "Losing their stash, their contacts, or their leverage.",
        "Being forced into loyalty they can’t break.",
        "Public exposure of their true motives.",
        "A debt they can’t pay.",
        "That mercy will get them killed.",
        "That they’ll need someone — and hate it.",
        "A rival who knows the same secrets.",
        "That they’ll be remembered as nothing at all."
      ],
      "bond": [
        "A hidden cache and the map only they can read.",
        "One person they won’t sell out — usually to their surprise.",
        "A secret society that taught them how to survive.",
        "A childhood debt they still repay in small ways.",
        "A prized dagger, lockpick set, or spell focus — part tool, part comfort.",
        "A tavern backroom where their network lives.",
        "A rival they respect because the rival plays smart.",
        "A ‘business partner’ they care about more than profit admits.",
        "A grudge that fuels them like fire.",
        "A name they stole — now worn like armor."
      ],
      "leverage": [
        "Pay them (coin/favor/secret) and name exactly what you want.",
        "Offer them a better deal than their current employer.",
        "Threaten to expose their stash or secret identity.",
        "Show them a path to profit that doesn’t end in a noose.",
        "Promise plausible deniability; they crave clean hands.",
        "Give them a secret they can trade — information is food.",
        "Show quiet reach against (their stash, their contact, their routine) — then speak softly.",
        "Offer them revenge on a rival.",
        "Close their exits (law, rivals, evidence) — then offer one safe door.",
        "Appeal to the one person they secretly care about."
      ],
      "tell": [
        "Counts coins even when talking about murder.",
        "Smiles without warmth, then offers a handshake anyway.",
        "Never says ‘yes’ — only ‘for a price.’",
        "Keeps glancing at everyone’s pockets out of habit.",
        "Talks in hypotheticals to avoid commitments.",
        "Taps a ring when lying.",
        "Always knows the nearest exit and the nearest guard.",
        "Calls everyone ‘friend’ like it’s a mask.",
        "Shrugs at morality, but flinches at betrayal.",
        "Pays debts on time; it’s good business."
      ],
      "complication": [
        "They’ll sell the PCs’ secret if the price is right.",
        "They’ll help… but only after securing collateral (hostage, item, debt).",
        "They’ll betray a good NPC to save themselves — unless the PCs stop it.",
        "They’ll drag the party into criminal politics they don’t understand.",
        "They’ll ‘solve’ a problem with a brutal shortcut that stains the party.",
        "They’ll keep a cursed {artifact} because it’s valuable.",
        "They’ll double-book alliances and cause a firefight.",
        "They’ll demand payment at the worst moment.",
        "They’ll frame an innocent to buy time.",
        "They’ll blackmail a party member with something true."
      ],
      "introduction": [
        "You meet them in the back room of an inn in the city of {city}, counting coin and smiling like it’s a knife.",
        "You meet them at a crossroads, offering directions that come with a price.",
        "You meet them selling information about {artifact}, swearing it’s ‘just business.’",
        "You meet them leaving a scene of violence, calm and unhurried, as if late for dinner.",
        "You meet them flattering the party while quietly measuring what you’re worth.",
        "You meet them offering help in exchange for a secret, not gold.",
        "You meet them negotiating with both sides of a conflict, promising each what they want to hear.",
        "You meet them watching from the shadows, stepping in only when someone is vulnerable.",
        "You meet them proposing a “clean solution” that leaves someone else holding the blame.",
        "You meet them with an exit plan already prepared—just in case you say no."
      ],
      "vice": [
        "They always want one more score; greed has no ceiling.",
        "They’re loyal only while it pays.",
        "They see traps everywhere and strike first.",
        "They push buttons “to see what happens.”",
        "They feed an addiction—substance, gambling, thrill, or magic.",
        "They choose comfort now and dismiss consequences.",
        "They can’t stand others winning; envy turns cold.",
        "They won’t act unless they can dodge blame."
      ]
    },
    "CE": {
      "goal": [
        "Burn down {faction} faction’s symbol of authority just to watch people panic.",
        "Unleash the threat of {threats} because terror tastes sweet.",
        "Claim {artifact} and use it to break things that ‘deserve breaking.’",
        "Start a war between rival gangs and profit from the screams.",
        "Kill the ‘hero’ of the city of {city} in public and dance in the ashes.",
        "Prove they’re the strongest by taking what they want openly.",
        "Break prisoners out — not to save them, but to add chaos.",
        "Summon something hungry and point it at their enemies.",
        "Ruin a festival, wedding, or holy day because joy offends them.",
        "Topple a ruler and leave a power vacuum like a wound."
      ],
      "fear": [
        "Boredom — silence — stillness.",
        "A stronger monster putting a leash on them.",
        "Being laughed at as weak.",
        "Being trapped where they can’t hurt anything.",
        "Losing the thrill that makes them feel alive.",
        "That they’ll have to answer for what they’ve done.",
        "That love will soften them and make them hesitate.",
        "A mirror that shows them they’re small.",
        "A plan that requires patience.",
        "Dying forgotten, without a legend."
      ],
      "bond": [
        "A violent crew that cheers when they go too far.",
        "A weapon they ‘named’ and talk to like a friend.",
        "A dark patron that rewards cruelty with power.",
        "A feud that defines them — someone who must suffer.",
        "A sibling or lover they protect like property.",
        "A place they burned once and want to burn again.",
        "A throne they don’t deserve but want anyway.",
        "A scar that reminds them of the one time they lost.",
        "A monster they unleashed and now treats like a pet.",
        "A cult that worships their violence like art."
      ],
      "leverage": [
        "Give them a target and a deadline; they love immediate violence.",
        "Offer a chance to humiliate someone publicly.",
        "If you threaten them, back it with overwhelming force — otherwise don’t.",
        "Appeal to greed, lust, or rage — simple wants move them.",
        "Promise them a fight worth remembering.",
        "Corner them with superior force; they respect strength.",
        "Offer an easy escape (scapegoat, chaos, open gate) — and point them at someone else.",
        "Dangle {artifact} like bait; they’ll lunge.",
        "Insult them and they’ll lose control.",
        "Deny them fear: stay calm, don’t beg, don’t flinch."
      ],
      "tell": [
        "Laughs at solemn moments.",
        "Cuts people off mid-sentence — then cuts something else.",
        "Fidgets like a predator about to pounce.",
        "Uses pet names right before violence.",
        "Breaks small objects while thinking.",
        "Stares too long, like measuring where to strike.",
        "Talks about pain like it’s weather.",
        "Says, ‘Why not?’ when asked for reasons.",
        "Chews on a toothpick like a knife.",
        "Gets quieter right before the storm."
      ],
      "complication": [
        "They’ll attack the party’s ally just to provoke a response.",
        "They ruin stealth with violence at the first inconvenience.",
        "They’ll burn evidence the party needed.",
        "They’ll trigger a massacre that forces the PCs into triage.",
        "They’ll betray any deal the moment it stops being fun.",
        "They’ll kill a captured villain to steal the PCs’ closure.",
        "They’ll frame the PCs for their crimes to watch them scramble.",
        "They’ll unleash a monster in the middle of negotiations.",
        "They’ll target civilians to force the party’s hand.",
        "They escalate conflicts until the entire town is involved."
      ],
      "introduction": [
        "You meet them in the aftermath of a fire, laughing at the panic like it’s music.",
        "You meet them at the edge of a riot in the city of {city}, provoking the crowd with cruel delight.",
        "You meet them kicking over a shrine of the deity {LG_deity} to see who dares to object.",
        "You meet them in a tavern brawl they started out of boredom—and escalated out of spite.",
        "You meet them carving a threat into a door, signing it like art.",
        "You meet them chasing someone weaker through {region} region, calling it ‘fun.’",
        "You meet them offering the party an alliance, then testing it by betraying you immediately.",
        "You meet them stalking a celebration, looking for the moment to ruin it.",
        "You meet them daring you to stop them—because they want the fight.",
        "You meet them smiling with blood on their hands, offended you expected remorse."
      ],
      "vice": [
        "They treat violence as entertainment.",
        "They break what they can’t own.",
        "They hurt first and never think.",
        "They burn bridges just to watch them fall.",
        "They can’t tolerate stability; they worship chaos.",
        "They bully weakness automatically.",
        "They escalate for the rush; power intoxicates them.",
        "They need others afraid; terror is their fuel."
      ]
    }
  },
  "mind": {
    "low": "Alignment is mostly instinct: blunt, immediate, hard to justify.",
    "avg": "Alignment is rationalized with simple sayings, common sense, and cultural norms.",
    "high": "Alignment is defended with doctrine or philosophy; they argue principles.",
    "vhigh": "Alignment is a detailed personal worldview; their logic can be subtle and long-range.",
    "genius": "Alignment is a grand moral system; they act like a founder, prophet, or philosopher-king."
  }
}